*>****************************************************************
*> Author: Joseph Warren
*> Date: 3/6/2019
*> Purpose: Add an employee to the index file
*> Tectonics: cobc
*>*****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. ADD_EMP.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT INDEX-FILE-EMP
        ASSIGN TO 'EMPLOYEE.IDX'
        ORGANIZATION IS INDEXED
        ACCESS IS RANDOM
        RECORD KEY IS IDX-empID
        ALTERNATE RECORD KEY IS IDX-lName WITH DUPLICATES.

DATA DIVISION.
FILE SECTION.
FD INDEX-FILE-EMP
        RECORD CONTAINS 161 CHARACTERS.
    COPY EMP_DEF REPLACING ==:TAG:== BY ==IDX==.

WORKING-STORAGE SECTION.
LINKAGE SECTION.
COPY EMP_DEF REPLACING ==:TAG:== BY ==LS==.

PROCEDURE DIVISION USING LS-EMPLOYEE.
MAIN-PROCEDURE.
    OPEN OUTPUT INDEX-FILE-EMP
    WRITE IDX-EMPLOYEE FROM LS-EMPLOYEE
      INVALID KEY DISPLAY 'INVALID KEY : ' IDX-empID ' | IGNORING'
      NOT INVALID KEY DISPLAY 'KEY ACCEPTED: ' IDX-empID ' ALT: ' IDX-lName
    END-WRITE
    CLOSE INDEX-FILE-EMP
   EXIT PARAGRAPH.
END PROGRAM ADD_EMP.
