*>****************************************************************
*> Author: Joseph Warren
*> Date: 3/6/2019
*> Purpose: Add a service to the index file
*> Tectonics: cobc
*>*****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. ADD_SERVICE.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT INDEX-FILE-SERVICE
        ASSIGN TO 'SERVICE.IDX'
        ORGANIZATION IS INDEXED
        ACCESS IS SEQUENTIAL
        RECORD KEY IS IDX-servID
        ALTERNATE RECORD KEY IS IDX-maintReqID WITH DUPLICATES.

DATA DIVISION.
FILE SECTION.
FD INDEX-FILE-SERVICE
        RECORD CONTAINS 53 CHARACTERS.
    COPY SERVICE_DEF REPLACING ==:TAG:== BY ==IDX==.

WORKING-STORAGE SECTION.

LINKAGE SECTION.
COPY SERVICE_DEF REPLACING ==:TAG:== BY ==LS==.

PROCEDURE DIVISION USING LS-SERVICE.
MAIN-PROCEDURE.
    OPEN OUTPUT INDEX-FILE-SERVICE
    WRITE IDX-SERVICE FROM LS-SERVICE
    CLOSE INDEX-FILE-SERVICE
   EXIT PARAGRAPH.
END PROGRAM ADD_SERVICE.
