*>****************************************************************
*> Author: Joseph Warren
*> Date: 3/6/2019
*> Purpose: Update an employee in the employee index file *DOES NOT WORK*
*> Tectonics: cobc
*>*****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. UPDATE_EMP.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT INDEX-FILE-EMP
        ASSIGN TO 'EMPLOYEE.IDX'
        ORGANIZATION IS INDEXED
        ACCESS IS SEQUENTIAL
        RECORD KEY IS IDX-empID
        ALTERNATE RECORD KEY IS IDX-LNAME WITH DUPLICATES.

DATA DIVISION.
FILE SECTION.
FD INDEX-FILE-EMP
        RECORD CONTAINS 161 CHARACTERS.
    COPY EMP_DEF REPLACING ==:TAG:== BY ==IDX==.

WORKING-STORAGE SECTION.

LINKAGE SECTION.
COPY EMP_DEF REPLACING ==:TAG:== BY ==LS==.

PROCEDURE DIVISION USING LS-EMPLOYEE.
MAIN-PROCEDURE.
    OPEN OUTPUT INDEX-FILE-EMP
    WRITE IDX-EMPLOYEE FROM LS-EMPLOYEE
    CLOSE INDEX-FILE-EMP
   EXIT PARAGRAPH.
END PROGRAM UPDATE_EMP.
