      ******************************************************************
      * Author: Matthew East
      * Date: 03/06/2019
      * Purpose: Edits an employee in the employee file
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EMPLOYEE_EDIT.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CONSOLE IS CRT.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL EMP-FILE
               ASSIGN TO '../INDEXES/EMPLOYEE.IDX'
               ORGANIZATION IS INDEXED
               ACCESS IS SEQUENTIAL
               RECORD KEY IS IDX-empID
               ALTERNATE RECORD KEY IS IDX-LNAME WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD EMP-FILE
           RECORD CONTAINS 161 CHARACTERS.
           COPY EMP_DEF REPLACING ==:TAG:== BY ==IDX==.
       WORKING-STORAGE SECTION.
           01 ARG-ID PIC 9(5).
           01 WS-WAGE PIC 9(5).9(2).
       SCREEN SECTION.
       01 EMPLOYEE-EDIT-SCREEN BLANK SCREEN
           FOREGROUND-COLOR 7 BACKGROUND-COLOR 0.
           05 TITLE-BAR FOREGROUND-COLOR 7 BACKGROUND-COLOR 1.
             10 VALUE SPACES PIC X(120).
             10 VALUE "EMPLOYEE MANAGEMENT - EDIT" LINE 1 COL 50.

           05 VALUE "EMPLOYEE ID #" LINE 3 COL 10.
           05 D-EMPID FROM IDX-EMPID LINE 3 COL 25.

           05 VALUE "FIRST NAME" LINE 4 COL 10.
           05 IN-FNAME PIC X(15) FROM IDX-FNAME TO IDX-FNAME
               LINE 4 COL 25.

           05 VALUE "LAST NAME" LINE 5 COL 10.
           05 IN-LNAME FROM IDX-LNAME TO IDX-LNAME LINE 5 COL 25.

           05 VALUE "SSN" LINE 6 COL 10.
           05 IN-SSN FROM IDX-SOCIAL TO IDX-SOCIAL LINE 6 COL 25.

           05 VALUE "PHONE #" LINE 7 COL 10.
           05 IN-PHONE FROM IDX-PHONE TO IDX-PHONE LINE 7 COL 25.

           05 VALUE "EMAIL" LINE 8 COL 10.
           05 IN-EMAIL FROM IDX-EMAIL TO IDX-EMAIL LINE 8 COL 25.

           05 VALUE "ADDRESS" LINE 9 COL 10.
           05 IN-ADDRESS FROM IDX-ADDRESS TO IDX-ADDRESS LINE 9 COL 25.

           05 VALUE "CITY" LINE 10 COL 10.
           05 IN-CITY FROM IDX-CITY TO IDX-CITY LINE 10 COL 25.

           05 VALUE "STATE" LINE 11 COL 10.
           05 IN-STATE FROM IDX-STATE TO IDX-STATE LINE 11 COL 25.

           05 VALUE "POSTAL CODE" LINE 12 COL 10.
           05 IN-POSTAL-CODE FROM IDX-ZIP TO IDX-ZIP
               LINE 12 COL 25.

           05 VALUE "WAGE" LINE 13 COL 10.
           05 IN-WAGE FROM WS-WAGE TO IDX-WAGE LINE 13 COL 25.

           05 VALUE "HOURLY?" LINE 14 COL 10.
           05 IN-HOURLY FROM IDX-HOURLY TO IDX-HOURLY LINE 14 COL 25.

           05 VALUE "POSITION" LINE 15 COL 10.
           05 IN-POSITION FROM IDX-POSITION TO IDX-POSITION
               LINE 15 COL 25.

           05 VALUE "ENTER - SAVE CHANGES" LINE 18 COL 35.
           05 VALUE "ESC - CANCEL" LINE 19 COL 35.

       PROCEDURE DIVISION.
       100-MAIN.
           ACCEPT ARG-ID FROM COMMAND-LINE.
           OPEN I-O EMP-FILE.
           MOVE ARG-ID TO IDX-EMPID.
           START EMP-FILE KEY IS EQUAL TO IDX-EMPID.
           READ EMP-FILE.
           MOVE IDX-WAGE TO WS-WAGE.
           DISPLAY EMPLOYEE-EDIT-SCREEN.
           ACCEPT EMPLOYEE-EDIT-SCREEN.
           REWRITE IDX-EMPLOYEE.
           CLOSE EMP-FILE.
           STOP RUN.
       END PROGRAM EMPLOYEE_EDIT.
