      ******************************************************************
      * Author: Matthew East
      * Date: 03/06/2019
      * Purpose: Adds a new employee to the employee file (UI mock only)
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EMPLOYEE_EDIT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 WS-FNAME PIC X(15) VALUE "JOHN".
           01 WS-LNAME PIC X(15) VALUE "DOE".
           01 WS-SSN PIC X(11) VALUE "699-45-1234".
           01 WS-PHONE PIC X(13) VALUE "417-555-1234".
           01 WS-EMAIL PIC X(25) VALUE "EXAMPLE@GMAIL.COM".
           01 WS-ADDRESS PIC X(25) VALUE "123 EXAMPLE ST".
           01 WS-CITY PIC X(25) VALUE "CARTHAGE".
           01 WS-STATE PIC XX VALUE "MO".
           01 WS-POSTAL-CODE PIC 9(5) VALUE 64836.
           01 WS-WAGE PIC 9(5)V9(2) VALUE 10.00.
           01 WS-HOURLY PIC XXX VALUE "YES".
           01 WS-POSITION PIC A(15) VALUE "ADMINISTRATOR".
           01 WS-DISPLAY-WAGE PIC $ZZZZZ.99.
       SCREEN SECTION.
       01 EMPLOYEE-EDIT-SCREEN BLANK SCREEN
           FOREGROUND-COLOR 7 BACKGROUND-COLOR 0.
           05 TITLE-BAR FOREGROUND-COLOR 7 BACKGROUND-COLOR 1.
             10 VALUE SPACES PIC X(120).
             10 VALUE "EMPLOYEE MANAGEMENT" LINE 1 COL 50.

           05 VALUE "EMPLOYEE ID #" LINE 3 COL 10.
           05 VALUE "00001" LINE 3 COL 25.

           05 VALUE "FIRST NAME" LINE 4 COL 10.
           05 IN-FNAME PIC X(15) FROM WS-FNAME TO WS-FNAME
               LINE 4 COL 25.

           05 VALUE "LAST NAME" LINE 5 COL 10.
           05 IN-LNAME FROM WS-LNAME TO WS-LNAME LINE 5 COL 25.

           05 VALUE "SSN" LINE 6 COL 10.
           05 IN-SSN FROM WS-SSN TO WS-SSN LINE 6 COL 25.

           05 VALUE "PHONE #" LINE 7 COL 10.
           05 IN-PHONE FROM WS-PHONE TO WS-PHONE LINE 7 COL 25.

           05 VALUE "EMAIL" LINE 8 COL 10.
           05 IN-EMAIL FROM WS-EMAIL TO WS-EMAIL LINE 8 COL 25.

           05 VALUE "ADDRESS" LINE 9 COL 10.
           05 IN-ADDRESS FROM WS-ADDRESS TO WS-ADDRESS LINE 9 COL 25.

           05 VALUE "CITY" LINE 10 COL 10.
           05 IN-CITY FROM WS-CITY TO WS-CITY LINE 10 COL 25.

           05 VALUE "STATE" LINE 11 COL 10.
           05 IN-STATE FROM WS-STATE TO WS-STATE LINE 11 COL 25.

           05 VALUE "POSTAL CODE" LINE 12 COL 10.
           05 IN-POSTAL-CODE FROM WS-POSTAL-CODE TO WS-POSTAL-CODE
               LINE 12 COL 25.

           05 VALUE "WAGE" LINE 13 COL 10.
           05 IN-WAGE FROM WS-DISPLAY-WAGE TO WS-WAGE LINE 13 COL 25.

           05 VALUE "HOURLY?" LINE 14 COL 10.
           05 IN-HOURLY FROM WS-HOURLY TO WS-HOURLY LINE 14 COL 25.

           05 VALUE "POSITION" LINE 15 COL 10.
           05 IN-POSITION FROM WS-POSITION TO WS-POSITION
               LINE 15 COL 25.

           05 VALUE "ENTER - SAVE CHANGES" LINE 18 COL 35.
           05 VALUE "ESC - CANCEL" LINE 19 COL 35.

       PROCEDURE DIVISION.
       100-MAIN.
           MOVE WS-WAGE TO WS-DISPLAY-WAGE.
           DISPLAY EMPLOYEE-EDIT-SCREEN.
           ACCEPT EMPLOYEE-EDIT-SCREEN.
           STOP RUN.
       END PROGRAM EMPLOYEE_EDIT.
