*>****************************************************************
*> Author:Aiden Stahl
*> Date:3/12/2019
*> Purpose: To allow access to other programs in the j&jauto system based on permissions
*>****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. JJUI.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.
01 USERNAME-IN PIC X(30).
01 PERMISSION-IN PIC A(5).
SCREEN SECTION.
 01 SALES-SCREEN.
           05 FOREGROUND-COLOR 07
               BACKGROUND-COLOR 00
               ERASE SCREEN.
           10 LINE 1 COLUMN 60 VALUE "SALES".
 01 MAINTENANCE-SCREEN.
                05 FOREGROUND-COLOR 07
               BACKGROUND-COLOR 00
               ERASE SCREEN.
           10 LINE 1 COLUMN 60 VALUE "MAINTENANCE".
 01 PARTS-SCREEN.
                05 FOREGROUND-COLOR 07
               BACKGROUND-COLOR 00
               ERASE SCREEN.
           10 LINE 1 COLUMN 60 VALUE "PARTS".
 01 CUSTOMER-MANAGMENT-SCREEN.
                05 FOREGROUND-COLOR 07
               BACKGROUND-COLOR 00
               ERASE SCREEN.
           10 LINE 1 COLUMN 60 VALUE "CUSTOMER MANAGEMENT".
 01 EMPLOYEE-MANAGEMENT-SCREEN.
                05 FOREGROUND-COLOR 07
               BACKGROUND-COLOR 00
               ERASE SCREEN.
           10 LINE 1 COLUMN 60 VALUE "CUSTOMER MANAGMENT".
 01 ADMINISTRATION-SCREEN.
            05 FOREGROUND-COLOR 07
               BACKGROUND-COLOR 00
               ERASE SCREEN.
           10 LINE 1 COLUMN 60 VALUE "ADMINISTRATION".
 01 REPORTING-SCREEN.
                05 FOREGROUND-COLOR 07
               BACKGROUND-COLOR 00
               ERASE SCREEN.
           10 LINE 1 COLUMN 60 VALUE "REPORTING".
PROCEDURE DIVISION.
100-MAIN-PROCEDURE.

200-Check-PERMISSIONS.
    STOP RUN.
END PROGRAM JJUI.
